Revit 2027 API
StructuralConnectionType.GetAllStructuralConnectionTypeIds Method
 Collects the ids of all StructuralConnectionTypes in the document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void GetAllStructuralConnectionTypeIds(
	Document cda,
	out ICollection<ElementId> ids
)
Public Shared Sub GetAllStructuralConnectionTypeIds (
	cda As Document,
	<OutAttribute> ByRef ids As ICollection(Of ElementId)
)
public:
static void GetAllStructuralConnectionTypeIds(
	Document^ cda,
	[OutAttribute] ICollection<ElementId^>^% ids
)
static member GetAllStructuralConnectionTypeIds :
        cda : Document *
        ids : ICollection<ElementId> byref -> unit
Parameters
cda Document
ids ICollection<ElementId>
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
StructuralConnectionType Class
Autodesk.Revit.DB.Structure Namespace